#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/managedkube/kubernetes-ops-staging-10-vpc/runs/run-JoUHCtUHP5tejrmm

Waiting for the plan to start...

Terraform v0.15.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0581d51ed44e8a26f]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-084b05823b940da73]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0cc88f93d453e234a]
module.vpc.module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-06bb15546190a0d0b]
module.vpc.module.vpc.aws_vpc_ipv4_cidr_block_association.this[0]: Refreshing state... [id=vpc-cidr-assoc-0d6a56e93ce08307c]
module.vpc.module.vpc.aws_subnet.elasticache[2]: Refreshing state... [id=subnet-0ed5de6646df618b1]
module.vpc.module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-0944ebd08152c4c32]
module.vpc.module.vpc.aws_subnet.elasticache[0]: Refreshing state... [id=subnet-0a050a197555f071a]
module.vpc.module.vpc.aws_subnet.elasticache[1]: Refreshing state... [id=subnet-0444f6a92d10c8550]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09f62c8496743f18b]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-009561f0c1c2d4c17]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0c2342ab8b308dd10]
module.vpc.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-06f84cd9ae4f7c5fb]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ebbc8f034ebf13bb]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0c941ea3d5e4c4515]
module.vpc.module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-05852ca0991019852]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-099567f7510b83b0b]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-08ffc13a6ecf0a324]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-037c08e33ea392633]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0a369e588718df41e]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-009561f0c1c2d4c171080289494]
module.vpc.module.vpc.aws_elasticache_subnet_group.elasticache[0]: Refreshing state... [id=dev]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-00f1f6172d7d0f1ca]
module.vpc.module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-07461bae994193c37]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cd33ab4488cd3bbf]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03b09e349e8ca8408]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-074902631c8bd7bce]
module.vpc.module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-049a4c084271c48d8]
module.vpc.module.vpc.aws_route_table_association.elasticache[2]: Refreshing state... [id=rtbassoc-0f0d639ab274157bb]
module.vpc.module.vpc.aws_route_table_association.elasticache[1]: Refreshing state... [id=rtbassoc-00ea09f62530b81e6]
module.vpc.module.vpc.aws_route_table_association.elasticache[0]: Refreshing state... [id=rtbassoc-05ae7cac273da7f43]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d9d5a1f78c483d46]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07a50d0880afc5a22]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0de77cc39c3a46bd7]
module.vpc.module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-05852ca09910198521080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.vpc.module.vpc.aws_elasticache_subnet_group.elasticache[0] will be updated in-place
  ~ resource "aws_elasticache_subnet_group" "elasticache" {
        id          = "dev"
        name        = "dev"
      ~ tags        = {
          + "Name"                 = "dev"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      ~ tags_all    = {
          + "Name"                 = "dev"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = "nat-074902631c8bd7bce"
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-099567f7510b83b0b"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = "nat-049a4c084271c48d8"
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-06f84cd9ae4f7c5fb"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.


```


</details>

*Pusher: @sekka1, Action: `pull_request`*